logs/fio-diskrnd/GWDG 4v 8GB/000/log009.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;183437;716;91460;0;0;0.000000;0.000000;89;176211;1382.423626;3874.094104;1.000000%=94;5.000000%=103;10.000000%=129;20.000000%=173;30.000000%=179;40.000000%=183;50.000000%=189;60.000000%=197;70.000000%=209;80.000000%=234;90.000000%=626;95.000000%=10682;99.000000%=14614;99.500000%=14614;99.900000%=15007;99.950000%=15269;99.990000%=90701;0%=0;0%=0;0%=0;92;176218;1387.908932;3874.111627;130560;1919488;100.000000%;183512.521978;133399.178944;0.425327%;14.335385%;7383;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;4.02%;79.01%;6.92%;0.05%;0.01%;0.01%;0.01%;0.75%;9.20%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;17;45266;0;110;143;4361935;4363173;99.21%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=6957: Sun Jan  7 19:08:52 2024
  write: IOPS=716, BW=179MiB/s (188MB/s)(16.0GiB/91460msec); 0 zone resets
    clat (usec): min=89, max=176211, avg=1382.42, stdev=3874.09
     lat (usec): min=92, max=176218, avg=1387.91, stdev=3874.11
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[  104], 10.00th=[  130], 20.00th=[  174],
     | 30.00th=[  180], 40.00th=[  184], 50.00th=[  190], 60.00th=[  198],
     | 70.00th=[  210], 80.00th=[  235], 90.00th=[  627], 95.00th=[10683],
     | 99.00th=[14615], 99.50th=[14615], 99.90th=[15008], 99.95th=[15270],
     | 99.99th=[90702]
   bw (  KiB/s): min=130560, max=1919488, per=100.00%, avg=183512.52, stdev=133399.18, samples=182
   iops        : min=  510, max= 7498, avg=716.84, stdev=521.09, samples=182
  lat (usec)   : 100=4.02%, 250=79.01%, 500=6.92%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.75%, 20=9.20%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.43%, sys=14.34%, ctx=7383, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=179MiB/s (188MB/s), 179MiB/s-179MiB/s (188MB/s-188MB/s), io=16.0GiB (17.2GB), run=91460-91460msec

Disk stats (read/write):
  vda: ios=17/45266, merge=0/110, ticks=143/4361935, in_queue=4363173, util=99.21%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;53123;207;315814;0;0;0.000000;0.000000;2140;1084025;4808.222889;6809.442983;1.000000%=2703;5.000000%=2932;10.000000%=3063;20.000000%=3293;30.000000%=3457;40.000000%=3620;50.000000%=3784;60.000000%=3981;70.000000%=4177;80.000000%=4489;90.000000%=5931;95.000000%=10027;99.000000%=25296;99.500000%=31326;99.900000%=53739;99.950000%=62652;99.990000%=214958;0%=0;0%=0;0%=0;2141;1084025;4808.568239;6809.445098;4096;70144;100.000000%;53239.098413;10700.817665;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.133940%;3.817132%;66341;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;61.83%;33.17%;3.18%;1.70%;0.09%;0.03%;0.01%;0.00%;0.00%;0.01%;0.00%;vda;65504;2989;0;11;304644;201044;505863;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=6961: Sun Jan  7 19:14:08 2024
  read: IOPS=207, BW=51.9MiB/s (54.4MB/s)(16.0GiB/315814msec)
    clat (msec): min=2, max=1084, avg= 4.81, stdev= 6.81
     lat (msec): min=2, max=1084, avg= 4.81, stdev= 6.81
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    6], 95.00th=[   11],
     | 99.00th=[   26], 99.50th=[   32], 99.90th=[   54], 99.95th=[   63],
     | 99.99th=[  215]
   bw (  KiB/s): min= 4096, max=70144, per=100.00%, avg=53239.10, stdev=10700.82, samples=630
   iops        : min=   16, max=  274, avg=207.90, stdev=41.80, samples=630
  lat (msec)   : 4=61.83%, 10=33.17%, 20=3.18%, 50=1.70%, 100=0.09%
  lat (msec)   : 250=0.03%, 500=0.01%, 2000=0.01%
  cpu          : usr=0.13%, sys=3.82%, ctx=66341, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=51.9MiB/s (54.4MB/s), 51.9MiB/s-51.9MiB/s (54.4MB/s-54.4MB/s), io=16.0GiB (17.2GB), run=315814-315814msec

Disk stats (read/write):
  vda: ios=65504/2989, merge=0/11, ticks=304644/201044, in_queue=505863, util=100.00%